# Notebook 5 - pandas
[pandas](http://pandas.pydata.org) provides high-level data structures and functions designed to make working with structured or tabular data fast, easy and expressive. The primary objects in pandas that we will be using are the `DataFrame`, a tabular, column-oriented data structure with both row and column labels, and the `Series`, a one-dimensional labeled array object.

pandas blends the high-performance, array-computing ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases. It provides sophisticated indexing functionality to make it easy to reshape, slice and perform aggregations.

While pandas adopts many coding idioms from NumPy, the most significant difference is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneous numerical array data.
<br>

## Table of Contents:
- [Data Structures](#structures)
    - [Series](#series)
    - [DataFrame](#dataframe)
- [Essential Functionality](#ess_func)
    - [Reindexing](#reindexing)
    - [Dropping Entries](#removing)
    - [Indexing, Slicing and Filtering](#indexing)
    - [Arithmetic Operations](#arithmetic)
- [Summarizing and Computing Descriptive Statistics](#sums)
- [Loading and storing data](#loading)
    - [Text Format](#text) 
    - [Web Scraping](#web)
- [Data Cleaning and preperation](#cleaning)
    - [Handling missing data](#missing)
    - [Data transformation](#transformation)
- [String manipulation](#strings)

The common pandas import statment is shown below:

In [1]:
# Common pandas import statement
import numpy as np
import pandas as pd

# Data Structures <a name="structures"></a>
## Series <a name="series"></a>
A Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels called its index.

The easiest way to make a Series is from an array of data:

In [2]:
data = pd.Series([4, 7, -5, 3])

Now try printing out data

In [3]:
data

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively shows the index on the left and the values on the right. Because we didn't specify an index, the default on is simply integers 0 through N-1.

You can output only the values of a Series using 
```python
data.values
```
or you can get only the indices using
```python
data.index
```
Try it out below!

In [4]:
data.values

array([ 4,  7, -5,  3])

You can specify custom indeces when intialising the Series

In [5]:
data2 = pd.Series([4, 7, -5, 3], index=["a", "b", "c", "d"])

In [6]:
data2

a    4
b    7
c   -5
d    3
dtype: int64

Now you can use these labels to access the data similar to a normal array

In [7]:
data2["a"]

4

Another way to think about Series is as a fixed-length ordered dictionary. Furthermore, you can actually define a Series in a similar manner to a dictionary

In [8]:
cities = {"Glasgow" : 599650, "Edinburgh" : 464990, "Abardeen" : 196670, "Dundee" : 147710}
data3 = pd.Series(cities)

In [9]:
data3

Glasgow      599650
Edinburgh    464990
Abardeen     196670
Dundee       147710
dtype: int64

You can do arithmetic operations between Series similar to NumPy arrays. Even if you have 2 datasets with different data, arithmetic operations will be aligned according to their indices.

Let's look at an example

In [10]:
cities_uk = {"Birmingham" : 1092330, "Leeds": 751485, "Glasgow" : 599650,
             "Manchester" : 503127, "Edinburgh" : 464990}
data4 = pd.Series(cities_uk)

In [11]:
data3 + data4

Abardeen            NaN
Birmingham          NaN
Dundee              NaN
Edinburgh      929980.0
Glasgow       1199300.0
Leeds               NaN
Manchester          NaN
dtype: float64

Notice how some of the results are NaN? Well, that is because there were no instances of those cities within both of the datasets. You can usually extract NaNs from a Series with
```python
data4.isnull()
```

## DataFrame <a name="dataframe"></a>
A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type. The DataFrame has both row and column index and can be thought of as a dict of Series all sharing the same index.

The most common way to create a DataFrame is with dicts

In [12]:
data = {"cities" : ["Glasgow", "Edinburgh", "Abardeen", "Dundee"],
        "population" : [599650, 464990, 196670, 147710],
        "year" : [2011, 2013, 2013, 2013]}
frame = pd.DataFrame(data)

Try printing it out

In [13]:
frame

      cities  population  year
0    Glasgow      599650  2011
1  Edinburgh      464990  2013
2   Abardeen      196670  2013
3     Dundee      147710  2013

Jupyter Notebooks prints it out in a nice table but the basic version of this is also just as readable!

Additionally you can also specify the order of columns during initialisation

In [14]:
frame2 = pd.DataFrame(data, columns=["year", "cities", "population"])

You can retrieve a particular column from a DataFrame with
```python
frame["cities"]
```
The result is going to be a Series

Additionally, you can retrieve a row from the dataset using
```python
frame[1]
```
Try it out below

In [30]:
frame[1]

SyntaxError: invalid syntax (<ipython-input-30-dd699a264eca>, line 1)

It is also possible to add and modify the columns of a DataFrame

In [21]:
frame2["size"] = 100

In [22]:
frame2

   year     cities  population  size
0  2011    Glasgow      599650   100
1  2013  Edinburgh      464990   100
2  2013   Abardeen      196670   100
3  2013     Dundee      147710   100

In [23]:
frame2["size"] = [175, 264, 65.1, 60]  # in km^2

Similar to dicts, columns can be deleted using
```python
del frame2["size"]
```

In [24]:
del frame2["size"]

Another common way of creating DataFrames is from a nested dict of dicts:

In [25]:
data2 = {"Glasgow": {2011: 599650},
        "Edinburgh": {2013:464990},
        "Abardeen": {2013: 196670}}

frame3 = pd.DataFrame(data)
frame3

      cities  population  year
0    Glasgow      599650  2011
1  Edinburgh      464990  2013
2   Abardeen      196670  2013
3     Dundee      147710  2013

Here is a table of different ways of initialising a DataFrame for your reference

| Type | Notes |
| --- | --- |
| 2D ndarray | A matrix of data; passing optional row and column labels |
| dict of arrays, lists, or tuples | Each sequence becomes a column in the DataFrame; all sequences must be the same length |
| NumPy structured/recorded array | Treated as with the "dict of arrays, lists or tuples" case |
| dict of Series | Each value becomes a column; indexes from each Series are unioned together to<br>form the result's row index if not explicit index is passed |
| dict of dicts | Each inner dict becomes a column; keys are unioned to form the row<br>index as in the "dict of Series" case |
| List of dicts or Series | Each item becomes a row in the DataFrame; union of dict keys or<br>Series indices becomes the DataFrame's column labels |
| List of lists or tuples | Treated as the "2D ndarray" case |
| Another DataFrame | The DataFrame's indexes are used unless different ones are passed |
| NumPy MaskedArray | Like the "2D ndarray" case except masked values become NA/missing in the DataFrame |

# Essential Functionality <a name="ess_func"></a>
In this section, we will go through the fundamental mechanics of interacting with the data contained in a Series or DaraFrame.

## Reindexing <a name="reindexing"></a>
With pandas it is easy to restructure the order of your columns and rows using the `reindex` function. Let's have a look at an example:

In [26]:
# first define a new Series
s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [27]:
# Now you can reshuffle the indices
s = s.reindex(['d', 'b', 'a', 'c', 'e'])
s

d    4
b    2
a    1
c    3
e    5
dtype: int64

Easy as that! This can also be extended for DataFrames, where you can reorder both the columns and indices at the same time!

In [28]:
# first define a new Dataframe
data = np.reshape(np.arange(9), (3,3))
df = pd.DataFrame(data, index=["a", "b", "c"],
                  columns=["Edinburgh", "Glasgow", "Aberdeen"])
df

   Edinburgh  Glasgow  Aberdeen
a          0        1         2
b          3        4         5
c          6        7         8

In [29]:
# Now we can restructure it with reindex
df = df.reindex(index=["a", "d", "c", "b"],
          columns=["Aberdeen", "Glasgow", "Edinburgh", "Dundee"])

Notice something interesting? We can actually add new indices and columns using the `reindex` method. This results in the new slots in our table to be filled in with `NaN` values.

## Removing columns/indices <a name="removing"></a>
Similarl to above, it is easy to remove entries. This is done with the `drop` method and can be applied to both columns and indices:

In [31]:
# define new DataFrame
data = np.reshape(np.arange(9), (3,3))
df = pd.DataFrame(data, index=["a", "b", "c"],
                  columns=["Edinburgh", "Glasgow", "Aberdeen"])

df.drop("b")

   Edinburgh  Glasgow  Aberdeen
a          0        1         2
c          6        7         8

In [32]:
# You can also drop from a column
df.drop(["Aberdeen", "Edinburgh"], axis="columns")

   Glasgow
a        1
b        4
c        7

## Indexing, slicing and filtering <a name="indexing"></a>

### Indexing

Series indexing works analogously to NumPy array indexing (i.e. data[...]). You can also use the Serie's index values instead of only integers:

In [33]:
s = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])
s

a    0
b    1
c    2
d    3
dtype: int64

In [34]:
s[1]

1

In [35]:
s[3]

3

In [36]:
s["c"]

2

In [37]:
s[[1,3]]

b    1
d    3
dtype: int64

In [40]:
s[s<2]

a    0
b    1
dtype: int64

A subtle difference when indexing in pandas is that unlike in normal Python, slicing here is inclusive at the end-point.

In [41]:
s["b":"c"]

b    1
c    2
dtype: int64

All of the above also apply to DataFrames:

In [42]:
data = np.reshape(np.arange(9), (3,3))
df = pd.DataFrame(data, index=["a", "b", "c"],
                  columns=["Edinburgh", "Glasgow", "Aberdeen"])

df

   Edinburgh  Glasgow  Aberdeen
a          0        1         2
b          3        4         5
c          6        7         8

In [43]:
df[:2]

   Edinburgh  Glasgow  Aberdeen
a          0        1         2
b          3        4         5

In [44]:
df["Glasgow"]

a    1
b    4
c    7
Name: Glasgow, dtype: int64

### loc and iloc
For DataFrame label-indexing on the rows, you can use `loc` for labels and `iloc` for integer-indexing.

In [45]:
df.loc["b"]

Edinburgh    3
Glasgow      4
Aberdeen     5
Name: b, dtype: int64

In [46]:
df.loc["b", ["Glasgow", "Aberdeen"]]

Glasgow     4
Aberdeen    5
Name: b, dtype: int64

Now let's try `iloc`

In [47]:
df.iloc[1]

Edinburgh    3
Glasgow      4
Aberdeen     5
Name: b, dtype: int64

In [48]:
df.iloc[1, [1,2]]

Glasgow     4
Aberdeen    5
Name: b, dtype: int64

In [49]:
df.iloc[:2]

   Edinburgh  Glasgow  Aberdeen
a          0        1         2
b          3        4         5

Summary of indexing:

| Type | Notes |
| -- | -- |
| df\[val\]              | Select single column or sequency of columns from a DataFrame |
| df.loc\[val\]          | Select single row or subset of rows from a DataFrame by label |
| df.loc\[:, val\]       | Select single column or subset of columns by label |
| df.loc\[val1, val2\]   | Select both rows and columns by label |
| df.iloc\[idx\]         | Select single row or subset of rows from DataFrame by integer position |
| df.iloc\[:, idx\]      | Select single column or subset of columns by integer position |
| df.iloc\[idx1, idx2\]  | Select both rows and columns by integer position |
| reindex method         | Select either rows or columns by labels |

### Exercise 1
A dataset of random numbers is created below. Index the 47th column and the 22nd row. You should get the number **4621**.

*Note: Remember that Python uses 0-based indexing*

In [53]:
df = pd.DataFrame(np.reshape(np.arange(10000), (100,100)))

4722

### Exercise 2
Using the same DataFrame from the previous exercise, obtain all rows starting from row 85 to 97.

0       47
1      147
2      247
3      347
4      447
5      547
6      647
7      747
8      847
9      947
10    1047
11    1147
12    1247
13    1347
14    1447
15    1547
16    1647
17    1747
18    1847
19    1947
20    2047
21    2147
22    2247
23    2347
24    2447
25    2547
26    2647
27    2747
28    2847
29    2947
      ...
70    7047
71    7147
72    7247
73    7347
74    7447
75    7547
76    7647
77    7747
78    7847
79    7947
80    8047
81    8147
82    8247
83    8347
84    8447
85    8547
86    8647
87    8747
88    8847
89    8947
90    9047
91    9147
92    9247
93    9347
94    9447
95    9547
96    9647
97    9747
98    9847
99    9947
Name: 47, Length: 100, dtype: int64

## Arithmetic <a name="arithmetic"></a>
When you are performing arithmetic operations between two objects, if any index pairs are not the same, the respective index in the result will be the union of the index pair. Let's have a look

In [57]:
s1 = pd.Series(np.arange(5), index=["a", "b", "c", "d", "e"])
s2 = pd.Series(np.arange(4), index=["b", "c", "d", "k"])
s1 + s2

a    NaN
b    1.0
c    3.0
d    5.0
e    NaN
k    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don't overlap. It is similar for DataFrames:

In [58]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),
                  columns=list("abcd"))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [59]:
df2 = pd.DataFrame(np.arange(16).reshape((4,4)),
                  columns=list("cdef"))
df2

    c   d   e   f
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [60]:
# adding the two
df1+df2

    a   b     c     d   e   f
0 NaN NaN   2.0   4.0 NaN NaN
1 NaN NaN  10.0  12.0 NaN NaN
2 NaN NaN  18.0  20.0 NaN NaN
3 NaN NaN   NaN   NaN NaN NaN

Notice how where we don't have matching values from `df1` and `df2` the output of the addition operation is `NaN` since there are no two numbers to add.

Well, we can "fix" that by filling in the `NaN` values. This effectively tells pandas where there are no two values to add, assume that the missing value is just zero.

In [61]:
df1.add(df2, fill_value=0)

     a    b     c     d     e     f
0  0.0  1.0   2.0   4.0   2.0   3.0
1  4.0  5.0  10.0  12.0   6.0   7.0
2  8.0  9.0  18.0  20.0  10.0  11.0
3  NaN  NaN  12.0  13.0  14.0  15.0

Another important point here is although the normal arithmetic operations work here, there also exist dedicated methods like `DataFrame.add()` which achieve the same functionality + a bit extra.

Here's a list of all arithmetic operations within pandas:

| Operator | Method | Description |
| -- | -- | -- |
| + | add, radd | Addition |
| - | sub, rsub | Subtraction |
| / | div, rdiv | Division |
| // | floordiv, rfloordiv | Floor division |
| * | mul, rmul | Multiplication |
| ** | pow, rpow | Exponentiation |

Notice how some of the methods have `r` in front of them? That stands for reversed and effectively reverses the operands. For example

```python
df1.div(df2)
```
would be the same as
```python
df2/df1
```

### Exercise 3
Create a (3,3) DataFrame and square all elements in it.

### Broadcasting
Similar to numpy, in pandas you can also broadcast data structures. Let's consider a simple example:

In [62]:
df1 = pd.DataFrame(np.arange(16).reshape((4,4)))
df1

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
df2 = pd.Series(np.arange(4))
df2

0    0
1    1
2    2
3    3
dtype: int64

In [64]:
df1 - df2

    0   1   2   3
0   0   0   0   0
1   4   4   4   4
2   8   8   8   8
3  12  12  12  12

Notice how the Series of [0, 1, 2, 3] got removed from each row? That is called broadcasting.

It can also be used for columns, but for that, you have to use the method arithmetic operations.

In [65]:
df1.sub(df2, axis="index")

   0   1   2   3
0  0   1   2   3
1  3   4   5   6
2  6   7   8   9
3  9  10  11  12

### Sorting
Sorting is an important built-in operation of pandas. Let's have a look at how you can do it:

In [66]:
df1 = pd.DataFrame(np.arange(16).reshape((4,4)), index=["b", "a", "d", "c"])
df1

    0   1   2   3
b   0   1   2   3
a   4   5   6   7
d   8   9  10  11
c  12  13  14  15

In [67]:
df2 = df1.sort_index()
df2

    0   1   2   3
a   4   5   6   7
b   0   1   2   3
c  12  13  14  15
d   8   9  10  11

Easy as that. Furthermore, you can also sort along the column axis with
```python
df1.sort_index(axis=1)
```

You can also sort by the actual values inside, but you have to give the column by which you want to sort.

In [68]:
df1 = pd.DataFrame([4, 3, 6, 1, 3, 5], columns=["a"])
df1

   a
0  4
1  3
2  6
3  1
4  3
5  5

In [69]:
df1.sort_values(by="a")

   a
3  1
1  3
4  3
0  4
5  5
2  6

## Summarizing and computing descriptive stats <a name="sums"></a>
`pandas` is equipped with common mathematical and statistical methods. Most of which fall into the category of reductions or summary statistics. These are methods that extract a single value from a list of values. For example, you can extract the mean of a `Series` object like this:

In [70]:
df = pd.DataFrame(np.arange(20).reshape(5,4),
                 columns=["a", "b", "c", "d"])
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [71]:
df.sum()

a    40
b    45
c    50
d    55
dtype: int64

Notice how that created the sum of each column?

Well you can actually make that the other way around by adding an extra option to `sum()`

In [72]:
df.sum(axis="columns")

0     6
1    22
2    38
3    54
4    70
dtype: int64

A similar method also exists for obtaining the mean of data:

In [73]:
df.mean()

a     8.0
b     9.0
c    10.0
d    11.0
dtype: float64

Finally, the mother of the methods we discussed here is `describe()`

In [74]:
df.describe()

               a          b          c          d
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

Here are all of the summary methods:

| Method | Description |
| -- | -- |
| count          | Number of non-NA values |
| describe       | Set of summary statistics |
| min, max       | Minimum, maximum values |
| argmin, argmax | Index locations at which the minimum or maximum value is obtained | 
| quantile       | Compute sample quantile ranging from 0 to 1 |
| sum            | Sum of values |
| mean           | Mean of values |
| median         | Arithmetic median of values |
| mad            | Mean absolute deviation from mean value |
| prod           | Product of all values |
| var            | Sample variance of values
| std            | Sample standard deviation of values
| cumsum         | Cumulative sum of values |
| cummin, cummax | Cumulative minimum or maximum of values, respectively |
| cumprod        | Cumulative product of values |
| value_counts() | Counts the number of occurrences of each unique element in a column |

### Exercise 4

A random DataFrame is created below. Find it's mean and standard deviation, then normalise it column-wise according to the formula:

$$ Y = \frac{X - \mu}{\sigma} $$

Where X is your dataset, $\mu$ is the mean and $\sigma$ is the standard deviation.

In [75]:
df = pd.DataFrame(np.random.uniform(0, 10, (100, 100)))

# Data Loading and Storing <a name="loading"></a>
Accessing data is a necessary first step for data science. In this section, the focus will be on data input and output in various formats using `pandas`

Data usually fall into these categories:
- text files
- binary files (more efficient space-wise)
- web data

## Text formats <a name="text"></a>
The most common format in this category is by far `.csv`. This is an easy to read file format which is usually visualised like a spreadsheet. The data itself is usually separated with a `,` which is called the **delimiter**.

Here is an example of a `.csv` file:

```
"Sell", "List", "Living", "Rooms", "Beds", "Baths", "Age", "Acres", "Taxes"
142, 160, 28, 10, 5, 3,  60, 0.28,  3167
175, 180, 18,  8, 4, 1,  12, 0.43,  4033
129, 132, 13,  6, 3, 1,  41, 0.33,  1471
138, 140, 17,  7, 3, 1,  22, 0.46,  3204
232, 240, 25,  8, 4, 3,   5, 2.05,  3613
135, 140, 18,  7, 4, 3,   9, 0.57,  3028
150, 160, 20,  8, 4, 3,  18, 4.00,  3131
207, 225, 22,  8, 4, 2,  16, 2.22,  5158
271, 285, 30, 10, 5, 2,  30, 0.53,  5702
 89,  90, 10,  5, 3, 1,  43, 0.30,  2054
 ```

It detailed home sale statistics. The first line is called the header, and you can imagine that it is the name of the columns of a spreadsheet.

Let's now see how we can load this data and analyse it. The file is located in the folder `data` and is called `homes.csv`. We can read it like this:

In [76]:
homes = pd.read_csv("data/homes.csv")

In [77]:
homes

    Sell   List   Living   Rooms   Beds   Baths   Age   Acres   Taxes
0    142    160       28      10      5       3    60    0.28    3167
1    175    180       18       8      4       1    12    0.43    4033
2    129    132       13       6      3       1    41    0.33    1471
3    138    140       17       7      3       1    22    0.46    3204
4    232    240       25       8      4       3     5    2.05    3613
5    135    140       18       7      4       3     9    0.57    3028
6    150    160       20       8      4       3    18    4.00    3131
7    207    225       22       8      4       2    16    2.22    5158
8    271    285       30      10      5       2    30    0.53    5702
9     89     90       10       5      3       1    43    0.30    2054
10   153    157       22       8      3       3    18    0.38    4127
11    87     90       16       7      3       1    50    0.65    1445
12   234    238       25       8      4       2     2    1.61    2087
13   106    116       20       8      4       1    13    0.22    2818
14   175    180       22       8      4       2    15    2.06    3917
15   165    170       17       8      4       2    33    0.46    2220
16   166    170       23       9      4       2    37    0.27    3498
17   136    140       19       7      3       1    22    0.63    3607
18   148    160       17       7      3       2    13    0.36    3648
19   151    153       19       8      4       2    24    0.34    3561
20   180    190       24       9      4       2    10    1.55    4681
21   293    305       26       8      4       3     6    0.46    7088
22   167    170       20       9      4       2    46    0.46    3482
23   190    193       22       9      5       2    37    0.48    3920
24   184    190       21       9      5       2    27    1.30    4162
25   157    165       20       8      4       2     7    0.30    3785
26   110    115       16       8      4       1    26    0.29    3103
27   135    145       18       7      4       1    35    0.43    3363
28   567    625       64      11      4       4     4    0.85   12192
29   180    185       20       8      4       2    11    1.00    3831
30   183    188       17       7      3       2    16    3.00    3564
31   185    193       20       9      3       2    56    6.49    3765
32   152    155       17       8      4       1    33    0.70    3361
33   148    153       13       6      3       2    22    0.39    3950
34   152    159       15       7      3       1    25    0.59    3055
35   146    150       16       7      3       1    31    0.36    2950
36   170    190       24      10      3       2    33    0.57    3346
37   127    130       20       8      4       1    65    0.40    3334
38   265    270       36      10      6       3    33    1.20    5853
39   157    163       18       8      4       2    12    1.13    3982
40   128    135       17       9      4       1    25    0.52    3374
41   110    120       15       8      4       2    11    0.59    3119
42   123    130       18       8      4       2    43    0.39    3268
43   212    230       39      12      5       3   202    4.29    3648
44   145    145       18       8      4       2    44    0.22    2783
45   129    135       10       6      3       1    15    1.00    2438
46   143    145       21       7      4       2    10    1.20    3529
47   247    252       29       9      4       2     4    1.25    4626
48   111    120       15       8      3       1    97    1.11    3205
49   133    145       26       7      3       1    42    0.36    3059

Easy right?

### Exercise 5
Find the mean selling price of the homes in `data/homes.csv`

The `read_csv` function has a lot of optional arguments (more than 50). It's impossible to memorise all of them - it's usually best just to look up the particular functionality when you need it. 

You can search `pandas read_csv` online and find all of the documentation.

There are also many other functions that can read textual data. Here are some of them:

| Function | Description
| -- | -- |
| read_csv       | Load delimited data from a file, URL, or file-like object. The default delimiter is a comma `,` |
| read_table     | Load delimited data from a file, URL, or file-like object. The default delimiter is tab `\t` |
| read_fwf       | Read data in fixed0width column format (i.e. no delimiters |
| read_clipboard | Reads the last object you have copied (Ctrl-C) |
| read_excel     | Read tabular data from Excel XLS or XLSX file |
| read_hdf       | Read HDF5 file written by pandas |
| read_html      | Read all tables found in the given HTML document |
| read_json      | Read data from a JSON string representation |
| read_sql       | Read the results of a SQL query |

*Note: there are also other loading functions which are not touched upon here*

### Exercise 6
There is another file in the data folder called `homes.xlsx`. Can you read it? Can you spot anything different?

In [78]:
pd.read_excel("data/homes.xlsx")

   Sell   List   Living   Rooms   Beds   Baths    Age   Acres    Taxes
0   142  160.0     28.0    10.0    5.0     3.0   60.0    0.28   3167.0
1   175  180.0     18.0     8.0    4.0     1.0   12.0    0.43   4033.0
2   129  132.0     13.0     6.0    3.0     1.0   41.0    0.33   1471.0
3   138  140.0     17.0     7.0    3.0     1.0   22.0    0.46   3204.0
4   232  240.0     25.0     8.0    4.0     3.0    5.0    2.05   3613.0
5   135  140.0     18.0     7.0    4.0     3.0    9.0    0.57   3028.0
6   150  160.0     20.0     8.0    4.0     3.0   18.0    4.00   3131.0
7   207  225.0     22.0     8.0    4.0     2.0   16.0    2.22   5158.0
8   271  285.0     30.0    10.0    5.0     2.0   30.0    0.53   5702.0
9    89   90.0     10.0     5.0    3.0     1.0   43.0    0.30   2054.0
10  153  157.0     22.0     8.0    3.0     3.0   18.0    0.38   4127.0
11   87   90.0     16.0     7.0    3.0     1.0   50.0    0.65   1445.0
12  234  238.0     25.0     8.0    4.0     2.0    2.0    1.61   2087.0
13  106  116.0     20.0     8.0    4.0     1.0   13.0    0.22   2818.0
14  175  180.0     22.0     8.0    4.0     2.0   15.0    2.06   3917.0
15  165  170.0     17.0     8.0    4.0     2.0   33.0    0.46   2220.0
16  166  170.0     23.0     9.0    4.0     2.0   37.0    0.27   3498.0
17  136  140.0     19.0     7.0    3.0     1.0   22.0    0.63   3607.0
18  148  160.0     17.0     7.0    3.0     2.0   13.0    0.36   3648.0
19  151  153.0     19.0     8.0    4.0     2.0   24.0    0.34   3561.0
20  180  190.0     24.0     9.0    4.0     2.0   10.0    1.55   4681.0
21  293  305.0     26.0     8.0    4.0     3.0    6.0    0.46   7088.0
22  167  170.0     20.0     9.0    4.0     2.0   46.0    0.46   3482.0
23  190  193.0     22.0     9.0    5.0     2.0   37.0    0.48   3920.0
24  184  190.0     21.0     9.0    5.0     2.0   27.0    1.30   4162.0
25  157  165.0     20.0     8.0    4.0     2.0    7.0    0.30   3785.0
26  110  115.0     16.0     8.0    4.0     1.0   26.0    0.29   3103.0
27  135  145.0     18.0     7.0    4.0     1.0   35.0    0.43   3363.0
28  567  625.0     64.0    11.0    4.0     4.0    4.0    0.85  12192.0
29  180  185.0     20.0     8.0    4.0     2.0   11.0    1.00   3831.0
30  183  188.0     17.0     7.0    3.0     2.0   16.0    3.00   3564.0
31  185  193.0     20.0     9.0    3.0     2.0   56.0    6.49   3765.0
32  152  155.0     17.0     8.0    4.0     1.0   33.0    0.70   3361.0
33  148  153.0     13.0     6.0    3.0     2.0   22.0    0.39   3950.0
34  152  159.0     15.0     7.0    3.0     1.0   25.0    0.59   3055.0
35  146  150.0     16.0     7.0    3.0     1.0   31.0    0.36   2950.0
36  170  190.0     24.0    10.0    3.0     2.0   33.0    0.57   3346.0
37  127  130.0     20.0     8.0    4.0     1.0   65.0    0.40   3334.0
38  265  270.0     36.0    10.0    6.0     3.0   33.0    1.20   5853.0
39  157  163.0     18.0     8.0    4.0     2.0   12.0    1.13   3982.0
40  128  135.0     17.0     9.0    4.0     1.0   25.0    0.52   3374.0
41  110  120.0     15.0     8.0    4.0     2.0   11.0    0.59   3119.0
42  123  130.0     18.0     8.0    4.0     2.0   43.0    0.39   3268.0
43  212  230.0     39.0    12.0    5.0     3.0  202.0    4.29   3648.0
44  145  145.0     18.0     8.0    4.0     2.0   44.0    0.22   2783.0
45  129  135.0     10.0     6.0    3.0     1.0   15.0    1.00   2438.0
46  143  145.0     21.0     7.0    4.0     2.0   10.0    1.20   3529.0
47  247  252.0     29.0     9.0    4.0     2.0    4.0    1.25   4626.0
48  111  120.0     15.0     8.0    3.0     1.0   97.0    1.11   3205.0
49  133  145.0     26.0     7.0    3.0     1.0   42.0    0.36   3059.0
50         NaN      NaN     NaN    NaN     NaN    NaN     NaN      NaN

### Writing CSV files
Easy!

In [79]:
homes.to_csv("test.csv")

### Exercise  7
Create a DataFrame which consists of all numbers 0 to 1000. Reshape it into 50 rows and save it to a `.csv` file. How many columns did you end up with?

### Exercise 8
There is a dataset `data/yob2012.txt` which lists the number of newborns registered in 2018 with their names and sex. Open the dataset in pandas, explore it and derive the ratio between male and female newborns.

## Web scraping <a name="web"></a>
It is also very easy to scrape webpages and extract tables from them.

For example, let's consider extracting the table of failed American banks.

In [80]:
url = "https://www.fdic.gov/bank/individual/failed/banklist.html"
banks = pd.read_html(url)
banks = banks[0]

ImportError: lxml not found, please install it

In [81]:
banks

NameError: name 'banks' is not defined

Powerful no? Now let's turn that into an exercise.

### Exercise 9
Given the data you just extracted above, can you analyse how many banks have failed per state?

Georgia (GA) should be the state with the most failed banks!

*Hint: try searching the web for pandas counting occurrences*

# Data Cleaning <a name="cleaning"></a>
While doing data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming and rearranging. Such tasks are often reported to take **up to 80%** or more of a data analyst's time. Often the way the data is stored in files isn't in the correct format and needs to be modified. Researchers usually do this on an ad-hoc basis using programming languages like Python.

In this chapter, we will discuss tools for handling missing data, duplicate data, string manipulation, and some other analytical data transformations.

## Handling missing data <a name="missing"></a>
Mussing data occurs commonly in many data analysis applications. One of the goals of pandas is to make working with missing data as painless as possible.

In pandas, missing numeric data is represented by `NaN` (Not a Number) and can easily be handled:

In [82]:
string_data = pd.Series(['orange', 'tomato', np.nan, 'avocado'])
string_data

0     orange
1     tomato
2        NaN
3    avocado
dtype: object

In [83]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Furthermore, the pandas `NaN` is functionally equlevant to the standard Python type `NoneType` which can be defined with `x = None`.

In [84]:
string_data[0] = None
string_data

0       None
1     tomato
2        NaN
3    avocado
dtype: object

In [85]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Here are some other methods which you can find useful:
    
| Method | Description |
| -- | -- |
| dropna | Filter axis labels based on whether the values of each label have missing data|
| fillna | Fill in missing data with some value |
| isnull | Return boolean values indicating which values are missing |
| notnull | Negation of isnull |

### Exercise 10
Remove the missing data below using the appropriate method

In [86]:
data = pd.Series([1, None, 3, 4, None, 6])
data

0    1.0
1    NaN
2    3.0
3    4.0
4    NaN
5    6.0
dtype: float64

`dropna()` by default removes any row/column that has a missing value. What if we want to remove only rows in which all of the data is missing though?

In [91]:
data = pd.DataFrame([[1., 6.5, 3.], [1., None, None],
                    [None, None, None], [None, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [92]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [93]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

### Exercise 11
That's fine if we want to remove missing data, what if we want to fill in missing data? Do you know of a way? Try to fill in all of the missing values from the data below with **0s**

In [94]:
data = pd.DataFrame([[1., 6.5, 3.], [2., None, None],
                    [None, None, None], [None, 1.5, 9.]])










pandas also allows us to interpolate the data instead of just filling it with a constant. The easiest way to do that is shown below, but there are more complex ones that are not covered in this course.

In [95]:
data.fillna(method="ffill")

     0    1    2
0  1.0  6.5  3.0
1  2.0  6.5  3.0
2  2.0  6.5  3.0
3  2.0  1.5  9.0

If you want you can explore the other capabilities of [`fillna`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html)

## Data Transformation  <a name="transformation"></a>
### Removing duplicates
Duplicate data can be a serious issue, luckily pandas offers a simple way to remove duplicates

In [96]:
data = pd.DataFrame([1, 2, 3, 4, 3, 2, 1])
data

   0
0  1
1  2
2  3
3  4
4  3
5  2
6  1

In [97]:
data.drop_duplicates()

   0
0  1
1  2
2  3
3  4

You can also select which rows to keep

In [98]:
data.drop_duplicates(keep="last")

   0
3  4
4  3
5  2
6  1

### Replacing data
You've already seen how you can fill in missing data with `fillna`. That is actually a special case of more general value replacement. That is done via the `replace` method.

Let's consider an example where the dataset given to us had `-999` as sentinel values for missing data instead of `NaN`.

In [99]:
data = pd.DataFrame([1., -999., 2., -999., 3., 4., -999, -999, 7.])
data

       0
0    1.0
1 -999.0
2    2.0
3 -999.0
4    3.0
5    4.0
6 -999.0
7 -999.0
8    7.0

In [100]:
data.replace(-999, np.nan)

     0
0  1.0
1  NaN
2  2.0
3  NaN
4  3.0
5  4.0
6  NaN
7  NaN
8  7.0

### Renaming axis indexes
Similar to `replace` you can also rename the labels of your axis

In [101]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Edinburgh', 'Glasgow', 'Aberdeen'])
data

           0  1   2   3
Edinburgh  0  1   2   3
Glasgow    4  5   6   7
Aberdeen   8  9  10  11

In [102]:
# create a map using a standard Python dictionary
mapping = { 0 : "one",
            1 : "two",
            2 : "three",
            3 : "four"}

# now rename the columns
data.rename(columns=mapping)

           one  two  three  four
Edinburgh    0    1      2     3
Glasgow      4    5      6     7
Aberdeen     8    9     10    11

Rows can be renamed in a similar fashion

### Detection and Filtering Outliers
Filtering or transforming outliers is largely a matter of applying array operations. Consider a DataFrame with some normally distributed data:

In [103]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.026552    -0.007912     0.001678    -0.047619
std       1.010300     0.980964     1.022289     1.008740
min      -3.490886    -3.952883    -2.824025    -3.410687
25%      -0.696013    -0.664201    -0.667879    -0.735838
50%      -0.014608     0.012376     0.018254    -0.078759
75%       0.660866     0.642424     0.678173     0.617265
max       3.185923     3.109778     3.361027     3.371655

Suppose you now want to lower all absolute values exceeding 3 from one of the columns

In [104]:
col = data[2]
col[np.abs(col) > 3]

54    3.361027
Name: 2, dtype: float64

In [105]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025998    -0.007102     0.001317    -0.047580
std       1.007406     0.977138     1.021164     1.006258
min      -3.000000    -3.000000    -2.824025    -3.000000
25%      -0.696013    -0.664201    -0.667879    -0.735838
50%      -0.014608     0.012376     0.018254    -0.078759
75%       0.660866     0.642424     0.678173     0.617265
max       3.000000     3.000000     3.000000     3.000000

### Permutation and Random Sampling

Permuting (randomly reordering) of rows in pandas is easy to do using the `numpy.random.permutation` function. Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [106]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [107]:
# generate random order
sampler = np.random.permutation(5)
sampler

array([1, 2, 0, 4, 3])

In [108]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

To select a random subset without replacement, you can use the sample method:

In [109]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

# String manipulation <a name="strings"></a>
Python has long been popular for its raw data manipulation in part due to its ease of use for string and text processing. Most text operations are made simple with the string object's built-in methods. For more complex pattern matching and text manipulations, regular expressions may be needed.

### Basics
Let's refresh what normal `str` (String objects) are capable of in Python

In [110]:
# complex strings can be broken into small bits
val = "Edinburgh is great"
val.split(" ")

['Edinburgh', 'is', 'great']

In [111]:
# substrings can be concatinated together with +
first, second, last = val.split(" ")
first + "::" + second + "::" + last

'Edinburgh::is::great'

Remember that Strings are just lists of individual charecters

In [112]:
val = "Edinburgh"
for each in val:
    print(each)

E
d
i
n
b
u
r
g
h

You can use standard list operations with them

In [113]:
val.find("n")

3

In [114]:
val.find("x")  # -1 means that there is no such element

-1

In [115]:
# and of course remember about upper() and lower()
val.upper()

'EDINBURGH'

If you want to learn more about strings you can always refer to the [Python manual](https://docs.python.org/2/library/string.html)

### Regular expressions
provide a flexible way to search or match (often more complex) string patterns in text. A single expression, commonly called *regex*, is a string formed according to the regular expression language. Python's built-in module is responsible for applying regular expression of strings via the `re` package

In [116]:
import re
text = "foo    bar\t baz   \tqux"
text

'foo    bar\t baz   \tqux'

In [117]:
re.split("\s+", text)

['foo', 'bar', 'baz', 'qux']

this expression effectively removed all whitespaces and tab characters (`\t`) which was stated with the `\s` regex and then the `+` after it means to remove any number of sequential occurrences of that character.

Let's have a look at a more complex example - identifying email addresses in a text file:

In [118]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

# pattern to be used for searching
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [119]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

Let's dissect the regex part by part:
```
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
```

- the `r` prefix before the string signals that the string should keep special characters such as the newline character `\n`. Otherwise, Python would just treat it as a newline
- `A-Z` means all letters from A to Z including lowercase and uppercase
- `0-9` similarly means all characters from 0 to 9
- the concatenation `._%+-` means just include those characters
- the square brackets [ ] means to combine all of the regular expressions inside. For example `[A-Z0-9._%+-]` would mean include all letters A to Z, all numbers 0 to 9, and the characters ._%+-
- `+` means to concatenate the strings patterns
- `{2,4}` means consider only 2 to 4 character strings

To summarise the pattern above searches for any combination of letters and numbers, followed by a `@`, then any combination of letters and numbers followed by a `.` with only 2 to 4 letters after it.

### Regular expressions and pandas
Let's see how they can be combined. Replicating the example above

In [ ]:
data = pd.Series({'Dave': 'Daves email dave@google.com', 'Steve': 'Steves email steve@gmail.com',
        'Rob': 'Robs rob@gmail.com', 'Wes': np.nan})
data

We can reuse the same `pattern` variable from above

In [ ]:
data.str.findall(pattern, flags=re.IGNORECASE)

pandas also offers more standard string operations. For example, we can check if a string is contained within a data row:

In [ ]:
data.str.contains("gmail")

Many more of these methods exist:
    
    
| Methods | Description |
| -- | -- |
| cat | Concatenate strings element-wise with optional delimiter |
| contains | Return boolean array if each string contains pattern/regex |
| count | Count occurrences of a pattern |
| extract | Use a regex with groups to extract one or more strings from a Series |
| findall | Computer list of all occurrences of pattern/regex for each string |
| get | Index into each element |
| isdecimal | Checks if the string is a decimal number |
| isdigit | Checks if the string is a digit |
| islower | Checks if the string is in lower case |
| isupper | Checks if the string is in upper case |
| join | Join strings in each element of the Series with passed seperator |
| len | Compute the length of each string |
| lower, upper | Convert cases |
| match | Returns matched groups as a list |
| pad | Adds whitespace to left, right or both sides of strings |
| repeat | Duplicate string values |
| slice | Slice each string in the Series |

### Exercise 12
There is a `dataset data/yob2012.txt` which lists the number of newborns registered in 2018 with their names and sex. Using regular expressions, extract all names from the dataset which start with letters A to C. How many names did you find?

Note: `^` is the "starting with" operator in regular expressions,

In [ ]:
Thanks